;SQL Server 2019 Configuration File
[OPTIONS]

; Указывая этот параметр и принимая условия Microsoft Python Open и Microsoft Python Server, вы подтверждаете, что прочитали и поняли условия использования. 

IACCEPTPYTHONLICENSETERMS="False"

; Задает поток операций установки, например INSTALL, UNINSTALL или UPGRADE. Это обязательный параметр. 

ACTION="Install"

; Роли установки устанавливают SQL Server в предопределенной конфигурации. 

ROLE="AllFeatures_WithDefaults"

; Указывая этот параметр и принимая условия Microsoft R Open и Microsoft R Server, вы подтверждаете, что прочитали и поняли условия использования. 

IACCEPTROPENLICENSETERMS="False"

; Указывает, что программа установки SQL Server не должна отображать заявление о конфиденциальности при запуске из командной строки. 

SUPPRESSPRIVACYSTATEMENTNOTICE="False"

; Для установки английской версии SQL Server в локализованной операционной системе Windows используйте параметр /ENU. 

ENU="False"

; Программа установки не будет выводить пользовательский интерфейс. 

QUIET="True"

; Программа установки будет только отображать ход установки без вмешательства пользователя. 

QUIETSIMPLE="False"

; Параметр, управляющий работой пользовательского интерфейса. Допустимые значения: Normal для полнофункционального интерфейса, AutoAdvance для упрощенного интерфейса и EnableUIOnServerCore для пропуска блока пользовательского интерфейса для установки основных серверных компонентов. 

UIMODE="AutoAdvance"

; Укажите, следует ли программе установки SQL Server обнаруживать и включать обновления продуктов. Допустимы значения True и False, а также 1 и 0. По умолчанию программа установки SQL Server включает найденные обновления. 

UpdateEnabled="False"

; Если предоставляется этот параметр, то компьютер будет использовать Центр обновления Майкрософт для проверки обновлений. 

USEMICROSOFTUPDATE="False"

; Указывает, что программа установки SQL Server не должна отображать уведомление о платном выпуске при запуске из командной строки. 

SUPPRESSPAIDEDITIONNOTICE="False"

; Укажите расположение каталога, из которого программа установки SQL Server будет получать обновления продуктов. Допустимые значения: "MU" для поиска в Центре обновления Майкрософт, действительный путь к папке, относительный путь, например ".\MyUpdates", или общий ресурс UNC. По умолчанию программа установки SQL Server выполняет поиск в Центре обновления Майкрософт или в службе Windows Update с помощью служб Windows Server Update Services. 

UpdateSource="MU"

; Указывает компоненты для установки, удаления или обновления. В список компонентов верхнего уровня входят SQL Server, службы AS, службы IS, службы MDS и средства. Компонент SQL установит ядро СУБД, компоненты Replication, Full-Text и сервер служб Data Quality Services (DQS). В составе компонента "Средства" устанавливаются общие компоненты. 

FEATURES=SQLENGINE

; Отображает сведения об использовании параметров командной строки. 

HELP="False"

; Указывает, что подробный журнал установки должен быть выведен на консоль. 

INDICATEPROGRESS="True"

; Указывает, что программа установки должна произвести установку в WOW64. Этот аргумент командной строки не поддерживается в 32-разрядных системах и IA64. 

X86="False"

; Укажите именованный экземпляр или экземпляр по умолчанию. MSSQLSERVER является экземпляром по умолчанию для всех выпусков, кроме экспресс-выпусков, а SQLExpress — для экспресс-выпусков. Этот параметр обязателен при установке ядра СУБД SQL Server (SQL) или служб Analysis Services (AS). 

INSTANCENAME="SQLEXPRESS"

; Укажите корневой каталог установки для общих компонентов.  Этот каталог не изменяется, если общие компоненты уже установлены. 

INSTALLSHAREDDIR="C:\Program Files\Microsoft SQL Server"

; Укажите корневой каталог установки для общих компонентов WOW64.  Этот каталог не изменяется, если общие компоненты WOW64 уже установлены. 

INSTALLSHAREDWOWDIR="C:\Program Files (x86)\Microsoft SQL Server"

; Укажите идентификатор экземпляра для указанных компонентов SQL Server. Структура каталогов SQL Server, структура реестра SQL Server и имена служб SQL Server будут включать в себя идентификатор данного экземпляра SQL Server. 

INSTANCEID="SQLEXPRESS"

; Учетная запись службы CEIP для SQL Server: домен\пользовательская или системная учетная запись. 

SQLTELSVCACCT="NT Service\SQLTELEMETRY$SQLEXPRESS"

; Тип запуска службы CEIP для SQL Server. 

SQLTELSVCSTARTUPTYPE="Automatic"

; Укажите каталог установки. 

INSTANCEDIR="C:\Program Files\Microsoft SQL Server"

; Имя учетной записи агента 

AGTSVCACCOUNT="NT AUTHORITY\NETWORK SERVICE"

; Автоматический запуск службы после установки.  

AGTSVCSTARTUPTYPE="Disabled"

; TCP-порт связи кирпича диспетчера подключений 

COMMFABRICPORT="0"

; Как матрица будет использовать частные сети 

COMMFABRICNETWORKLEVEL="0"

; Как осуществляется защита связи между кирпичами 

COMMFABRICENCRYPTION="0"

; TCP-порт, который используется кирпичом диспетчера подключений 

MATRIXCMBRICKCOMMPORT="0"

; Тип запуска для службы SQL Server. 

SQLSVCSTARTUPTYPE="Automatic"

; Уровень, на котором включается компонент FILESTREAM (0, 1, 2 или 3). 

FILESTREAMLEVEL="0"

; Параметр конфигурации сервера "Максимальная степень параллелизма" (MAXDOP). 

SQLMAXDOP="0"

; Чтобы включить RANU для выпуска SQL Server Express, укажите значение "1". 

ENABLERANU="True"

; Задает параметры сортировки Windows или параметры сортировки SQL Server для ядра СУБД. 

SQLCOLLATION="Cyrillic_General_CI_AS"

; Учетная запись для службы SQL Server: Домен\Пользователь или системная учетная запись. 

SQLSVCACCOUNT="NT Service\MSSQL$SQLEXPRESS"

; Установите значение "True", чтобы включить мгновенную инициализацию файлов для службы SQL Server. Если этот параметр включен, программа установки предоставит права на выполнение задач обслуживания тома SID службы ядра СУБД. Это может привести к раскрытию информации, так как неавторизованный пользователь сможет получить доступ к удаленному содержимому. 

SQLSVCINSTANTFILEINIT="True"

; Одна или несколько учетных записей Windows для подготовки в качестве системных администраторов SQL Server. 

SQLSYSADMINACCOUNTS="DESKTOP-C73J7NQ\Kri"

; Число файлов ядра СУБД TempDB. 

SQLTEMPDBFILECOUNT="1"

; Задает первоначальный размер файла данных TempDB ядра СУБД (в МБ). 

SQLTEMPDBFILESIZE="8"

; Задает автоматическое увеличение прироста каждого файла данных TempDB ядра СУБД (в МБ). 

SQLTEMPDBFILEGROWTH="64"

; Задает первоначальный размер файла журнала TempDB ядра СУБД (в МБ). 

SQLTEMPDBLOGFILESIZE="8"

; Задает автоматическое увеличение прироста файла журнала TempDB ядра СУБД (в МБ). 

SQLTEMPDBLOGFILEGROWTH="64"

; Подготовьте текущего пользователя как системного администратора ядра СУБД для SQL Server 2019 Express. 

ADDCURRENTUSERASSQLADMIN="True"

; Укажите 0, чтобы выключить, или 1, чтобы включить протокол TCP/IP. 

TCPENABLED="0"

; Укажите 0, чтобы отключить, или 1, чтобы включить протокол Named Pipes. 

NPENABLED="0"

; Тип запуска для службы обозревателя. 

BROWSERSVCSTARTUPTYPE="Disabled"

; Используйте параметр SQLMAXMEMORY, чтобы свести к минимуму риск нехватки памяти для ОС. 

SQLMAXMEMORY="2147483647"

; Используйте параметр SQLMINMEMORY, чтобы зарезервировать минимальный объем памяти, который доступен диспетчеру памяти SQL Server. 

SQLMINMEMORY="0"
